window.onload = ->
	NationalityConfig = 
		theme: "theme1"
		title:
			text: "Классификация по национальности"
		animationEnabled: true
		data: [
			type: "doughnut"
			dataPoints: [
				{ name: "Беларусь", label: "Беларусь",  y: 30  },
				{ name: "Россия", label: "Россия", y: 25  },
				{ name: "Украина", label: "Украина", y: 28  },
				{ name: "Казахстан", label: "Казахстан",  y: 10  },
				{ name: "Таджикистан", label: "Таджикистан",  y: 15  }
			]
		]
	NationalityChart = new CanvasJS.Chart "NationalityChart", NationalityConfig
	NationalityChart.render()

	FacultyConfig = 
		theme: "theme1"
		title:
			text: "Классификация по факультетам"
		animationEnabled: true
		data: [
			type: "column"
			dataPoints: [
                {label: "Хирургический факультет", y:354},
                {label: "Терапевтический факультет", y:543},
                {label: "Педиатрический факультет", y:123},
                {label: "Факультет общественного здоровьяbr> и здравоохранения", y:434}
            ]
		]
	FacultyChart = new CanvasJS.Chart "FacultyChart", FacultyConfig
	FacultyChart.render()

	SpecialityConfig = 
		theme: "theme1"
		title:
			text: "Классификация по специальностям"
		animationEnabled: true
		data: [
			type: "column"
			dataPoints: [
                    {label: "Кафедра анестезиологии и реаниматологии", y:120},
                    {label: "Кафедра челюстно-лицевой хирургии", y:110},
                    {label: "Кафедра хирургии", y:130},
                    {label: "Кафедра трансплантологии", y:104},
                    {label: "Кафедра урологии и нефрологии", y:105},
                    {label: "Кафедра травматологии и ортопедии", y:150},
                    {label: "Кафедра пластической хирургии и комбустиологии", y:143},
                    {label: "Кафедра терапевтической стоматологии", y:112},
                    {label: "Кафедра офтальмологии", y:165},
                    {label: "Кафедра оториноларингологии", y:243},
                    {label: "Кафедра ортопедической стоматологии и ортодонтии с курсом детской стоматологии", y:235},
                    {label: "Кафедра онкологии", y:344},
                    {label: "Кафедра общей стоматологии", y:130},
                    {label: "Кафедра неотложной хирургии", y:160},
                    {label: "Кафедра кардиохирургии", y:104},
                    {label: "Кафедра геронтологии и гериатрии с курсом аллергологии и профпатологии", y:123},
                    {label: "Кафедра гастроэнтерологии и нутрициологии", y:154},
                    {label: "Кафедра дерматовенерологии и косметологии", y:187},
                    {label: "Кафедра кардиологии и ревматологии", y:156},
                    {label: "Кафедра клинической фармакологии и фармакотерапии", y:234},
                    {label: "Кафедра неврологии и нейрохирургии", y:345},
                    {label: "Кафедра психиатрии и наркологии", y:123},
                    {label: "Кафедра пульмонологии и фтизиатрии", y:152},
                    {label: "Кафедра рефлексотерапии", y:354},
                    {label: "Кафедра функциональной диагностики", y:232},
                    {label: "Кафедра эндокринологии", y:342},
                    {label: "Кафедра акушерства и гинекологии", y:122},
                    {label: "Кафедра акушерства, гинекологии и репродуктивного здоровья", y:245},
                    {label: "Кафедра детской анестезиологии и реаниматологии", y:222},
                    {label: "Кафедра детской неврологии", y:232},
                    {label: "Кафедра детской онкологии и гематологии", y:150},
                    {label: "Кафедра детской хирургии", y:190},
                    {label: "Кафедра неонатологии и медицинской генетики", y:166},
                    {label: "Кафедра инфекционных болезней и детских инфекций", y:144},
                    {label: "Кафедра клинической гематологии и трансфузиологии", y:223},
                    {label: "Кафедра педиатрии", y:234},
                    {label: "Кафедра поликлинической педиатрии", y:235},
                    {label: "Кафедра психотерапии и медицинской психологии", y:293},
                    {label: "Кафедра физиотерапии и курортологии", y:274},
                    {label: "Кафедра гигиены и медицинской экологии", y:186},
                    {label: "Кафедра клинической лабораторной диагностики", y:245},
                    {label: "Кафедра лучевой диагностики", y:234},
                    {label: "Кафедра медицинской экспертизы и реабилитации", y:254},
                    {label: "Кафедра общественного здоровья и здравоохранения", y:255},
                    {label: "Кафедра общей врачебной практики", y:231},
                    {label: "Кафедра спортивной медицины и лечебной физической культуры", y:128},
                    {label: "Кафедра скорой медицинской помощи и медицины катастроф", y:256},
                    {label: "Кафедра ультразвуковой диагностики", y:322},
                    {label: "Кафедра экономики и бухгалтерского учёта в здравоохранении с курсом медицинской информатики", y:234},
                    {label: "Кафедра эпидемиологии и микробиологии", y:258}
	            ]
		]
	SpecialityChart = new CanvasJS.Chart "SpecialityChart", SpecialityConfig
	SpecialityChart.render()